Revit 2027 API
ImporterIFC.FullFileName Property
 The full file name of the IFC file to be import.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string FullFileName { get; }
Public ReadOnly Property FullFileName As String
	Get
public:
property String^ FullFileName {
	String^ get ();
}
member FullFileName : string with get
Property Value
String
See Also
Reference
ImporterIFC Class
Autodesk.Revit.DB.IFC Namespace